php_includes/application/libraries/3PL/php-3pl-central-master/src/Request/createOrder.xml

<?xml version="1.0" encoding="UTF-8"?>
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <extLoginData xmlns="http://www.JOI.com/schemas/ViaSub.WMS/">
      <ThreePLKey>{ThreePLID}</ThreePLKey>
      <Login>{Login}</Login>
      <Password>{Password}</Password>
      <FacilityID>{FacilityID}</FacilityID>
      <CustomerID>{CustomerID}</CustomerID>
    </extLoginData>
    <orders xmlns="http://www.JOI.com/schemas/ViaSub.WMS/">
      <Order>
        <TransInfo>
          <ReferenceNum>{ReferenceNum}</ReferenceNum>
        </TransInfo>
        <ShipTo>
          <Name>{Name}</Name>
          <CustomerName>{CustomerName}</CustomerName>
        </ShipTo>
      </Order>
    </orders>
  </soap:Body>
</soap:Envelope>